In [2]:
%load_ext sql
%sql postgresql://postgres:milan19@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

Генерация данных:

In [10]:
%%sql
CREATE TABLE customers (
    customer_id SERIAL PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100),
    registration_date TIMESTAMP
);

CREATE TABLE orders (
    order_id SERIAL PRIMARY KEY,
    customer_id INT REFERENCES customers(customer_id),
    order_date TIMESTAMP,
    total_amount DECIMAL(10,2)
);

CREATE TABLE order_items (
    order_item_id SERIAL PRIMARY KEY,
    order_id INT REFERENCES orders(order_id),
    product_id INT,
    quantity INT,
    price NUMERIC(10,2)
);

INSERT INTO customers (name, email, registration_date)
SELECT 
    'Customer ' || i,
    'customer' || i || '@example.com',
    NOW() - (random() * INTERVAL '2 years')
FROM generate_series(1, 1000) AS i;

INSERT INTO orders (customer_id, order_date, total_amount)
SELECT 
    floor(random() * 1000 + 1), 
    NOW() - (random() * INTERVAL '1 year'),
    round((random() * 500 + 10)::numeric, 2)
FROM generate_series(1, 5000);

INSERT INTO order_items (order_id, product_id, quantity, price)
SELECT 
    floor(random() * 5000 + 1),
    floor(random() * 200 + 1),
    floor(random() * 10 + 1),
    round((random() * 100 + 5)::numeric, 2)
FROM generate_series(1, 10000);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1000 rows affected.

5000 rows affected.

10000 rows affected.

++
||
++
++

1. Поиск самых активных клиентов.Найти топ-5 клиентов, которые сделали наибольшее количество заказов

In [11]:
%%sql
SELECT customer_id, COUNT(*) AS total_orders
FROM orders
GROUP BY customer_id
ORDER BY total_orders DESC
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+-------------+--------------+
| customer_id | total_orders |
+-------------+--------------+
|     805     |      14      |
|     414     |      12      |
|     116     |      12      |
|     739     |      12      |
|     904     |      11      |
+-------------+--------------+

 2. Вычисление среднего чека.Найти среднюю сумму заказа

In [12]:
%%sql
SELECT AVG(total_amount) AS average_order_value
FROM orders;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+----------------------+
| average_order_value  |
+----------------------+
| 261.2839720000000000 |
+----------------------+

3. Тренд продаж по месяцам.Посчитать суммарную выручку по месяцам за последний год

In [13]:
%%sql
SELECT DATE_TRUNC('month', order_date) AS month, SUM(total_amount) AS revenue
FROM orders
WHERE order_date >= NOW() - INTERVAL '1 year'
GROUP BY month
ORDER BY month;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

13 rows affected.

+---------------------+-----------+
|        month        |  revenue  |
+---------------------+-----------+
| 2024-03-01 00:00:00 |  71546.48 |
| 2024-04-01 00:00:00 | 120535.07 |
| 2024-05-01 00:00:00 | 106311.45 |
| 2024-06-01 00:00:00 | 110090.47 |
| 2024-07-01 00:00:00 | 113551.74 |
| 2024-08-01 00:00:00 | 110676.94 |
| 2024-09-01 00:00:00 | 109400.37 |
| 2024-10-01 00:00:00 |  98386.80 |
| 2024-11-01 00:00:00 | 108304.16 |
| 2024-12-01 00:00:00 | 104779.49 |
+---------------------+-----------+
Truncated to displaylimit of 10.

4. Анализ частоты покупок.Найти средний интервал между покупками для каждого клиента

In [14]:
%%sql
WITH order_gaps AS (
    SELECT 
        customer_id, 
        order_date - LAG(order_date) OVER (PARTITION BY customer_id ORDER BY order_date) AS days_between_orders
    FROM orders
)
SELECT 
    customer_id, 
    AVG(days_between_orders) AS avg_days_between_orders
FROM order_gaps
WHERE days_between_orders IS NOT NULL
GROUP BY customer_id;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

967 rows affected.

+-------------+--------------------------+
| customer_id | avg_days_between_orders  |
+-------------+--------------------------+
|      1      | 38 days, 4:11:30.192000  |
|      2      | 33 days, 1:05:36.458057  |
|      4      | 99 days, 1:43:45.897600  |
|      6      | 40 days, 15:39:30.988800 |
|      7      | 114 days, 0:06:44.222400 |
|      8      | 48 days, 4:15:11.232000  |
|      9      | 87 days, 1:58:13.036800  |
|      10     | 58 days, 4:17:23.848800  |
|      11     | 46 days, 1:59:12.580800  |
|      12     | 38 days, 23:09:26.755200 |
+-------------+--------------------------+
Truncated to displaylimit of 10.

5. Поиск аномально дорогих заказов.Найти заказы, сумма которых выше 95-го процентиля

In [15]:
%%sql
SELECT *
FROM orders
WHERE total_amount > (SELECT PERCENTILE_CONT(0.95) WITHIN GROUP (ORDER BY total_amount) FROM orders);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

250 rows affected.

+----------+-------------+----------------------------+--------------+
| order_id | customer_id |         order_date         | total_amount |
+----------+-------------+----------------------------+--------------+
|    38    |     410     | 2024-05-20 12:40:02.623347 |    500.84    |
|   125    |      60     | 2025-02-07 00:04:10.485747 |    497.64    |
|   136    |     327     | 2025-01-31 06:49:54.549747 |    492.07    |
|   139    |     921     | 2024-09-24 18:44:33.141747 |    492.04    |
|   151    |     937     | 2025-02-06 17:26:31.471347 |    506.79    |
|   157    |     591     | 2024-11-07 23:16:32.114547 |    502.69    |
|   169    |      54     | 2024-03-28 01:47:48.088947 |    493.87    |
|   193    |     181     | 2024-05-01 18:22:31.653747 |    508.38    |
|   241    |     385     | 2025-02-23 17:05:46.188147 |    508.05    |
|   247    |     997     | 2024-08-26 18:54:24.031347 |    504.37    |
+----------+-------------+----------------------------+--------------+
Truncated to displaylimit of 10.

6. Объединение данных о пользователях и заказах.Получить список клиентов с их последними заказами

In [16]:
%%sql
SELECT c.customer_id, c.name, o.order_id, o.total_amount, o.order_date
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
WHERE o.order_date = (SELECT MAX(order_date) FROM orders WHERE customer_id = c.customer_id);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

996 rows affected.

+-------------+--------------+----------+--------------+----------------------------+
| customer_id |     name     | order_id | total_amount |         order_date         |
+-------------+--------------+----------+--------------+----------------------------+
|     810     | Customer 810 |    3     |    442.76    | 2025-03-04 11:24:16.341747 |
|     839     | Customer 839 |    4     |    96.77     | 2024-12-30 12:36:07.096947 |
|     822     | Customer 822 |    6     |    457.32    | 2025-01-08 13:22:56.824947 |
|     504     | Customer 504 |    12    |    474.25    | 2024-12-26 17:14:18.021747 |
|      2      |  Customer 2  |    14    |    275.53    | 2025-02-04 20:52:43.087347 |
|     639     | Customer 639 |    16    |    355.13    | 2024-09-07 17:14:02.556147 |
|     665     | Customer 665 |    29    |    240.16    | 2025-02-03 01:48:47.013747 |
|     847     | Customer 847 |    30    |    73.55     | 2024-12-25 04:20:20.700147 |
|     842     | Customer 842 |    34    |    311.80    | 2024-12-06 08:46:57.832947 |
|     983     | Customer 983 |    39    |    367.70    | 2025-01-02 09:30:39.468147 |
+-------------+--------------+----------+--------------+----------------------------+
Truncated to displaylimit of 10.

7. Анализ конверсии пользователей в покупателей.Найти процент зарегистрированных пользователей, которые сделали хотя бы один заказ

In [17]:
%%sql
SELECT (COUNT(DISTINCT o.customer_id) * 100.0 / COUNT(*)) AS conversion_rate
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+---------------------+
|   conversion_rate   |
+---------------------+
| 19.9040767386091127 |
+---------------------+

8. Категоризация товаров по продажам.Разделить товары на категории по числу продаж (топовые, средние, редкие)

In [18]:
%%sql
SELECT product_id, COUNT(*) AS sales_count,
       CASE
           WHEN COUNT(*) > 100 THEN 'Топ'
           WHEN COUNT(*) BETWEEN 20 AND 100 THEN 'Средние'
           ELSE 'Редкие'
       END AS category
FROM order_items
GROUP BY product_id;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

200 rows affected.

+------------+-------------+----------+
| product_id | sales_count | category |
+------------+-------------+----------+
|     58     |      47     | Средние  |
|     8      |      50     | Средние  |
|    184     |      46     | Средние  |
|     87     |      48     | Средние  |
|    116     |      59     | Средние  |
|     71     |      45     | Средние  |
|     68     |      69     | Средние  |
|     51     |      43     | Средние  |
|    146     |      38     | Средние  |
|     80     |      47     | Средние  |
+------------+-------------+----------+
Truncated to displaylimit of 10.

9. Распределение заказов по временным интервалам.Найти, в какие часы происходит больше всего заказов

In [19]:
%%sql
SELECT EXTRACT(HOUR FROM order_date) AS order_hour, COUNT(*) AS order_count
FROM orders
GROUP BY order_hour
ORDER BY order_count DESC;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

24 rows affected.

+------------+-------------+
| order_hour | order_count |
+------------+-------------+
|     23     |     250     |
|     2      |     231     |
|     9      |     220     |
|     19     |     218     |
|     15     |     217     |
|     0      |     217     |
|     4      |     215     |
|     8      |     214     |
|     21     |     213     |
|     20     |     212     |
+------------+-------------+
Truncated to displaylimit of 10.

10. Поиск пользователей, которые стали неактивными.Найти пользователей, которые не делали заказов за последние 6 месяцев

In [20]:
%%sql
SELECT c.customer_id, c.name
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id AND o.order_date >= NOW() - INTERVAL '6 months'
WHERE o.customer_id IS NULL;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

73 rows affected.

+-------------+--------------+
| customer_id |     name     |
+-------------+--------------+
|      3      |  Customer 3  |
|      16     | Customer 16  |
|      19     | Customer 19  |
|      57     | Customer 57  |
|      81     | Customer 81  |
|      85     | Customer 85  |
|     109     | Customer 109 |
|     125     | Customer 125 |
|     127     | Customer 127 |
|     138     | Customer 138 |
+-------------+--------------+
Truncated to displaylimit of 10.